{"meta":{"title":"Hello! my name is Darius.","subtitle":"Stop thinking too much, just do it. ✔","description":2,"author":"Zhang Chi","url":"http://yoursite.com","root":"/"},"pages":[{"title":"tags","date":"2019-08-13T13:00:03.000Z","updated":"2019-08-13T13:00:03.527Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"观影日记：years and years","slug":"观影日记：years and years","date":"2019-08-20T16:00:00.000Z","updated":"2019-08-21T10:10:16.191Z","comments":true,"path":"2019/08/21/观影日记：years and years/","link":"","permalink":"http://yoursite.com/2019/08/21/观影日记：years and years/","excerpt":"","text":"注：图片来自IMBD,可能需要科学上网。 痛快，看完整部剧的感觉完全就是痛快。 政治、国家和家庭，circle of life，一切都是息息相关。 政治和新闻貌似在我的前十八年中最为无聊。但这部剧完完全全在敲响这个警钟。这个无聊的游戏可以轻易地摧毁一个和睦完美的家庭，也可以使一个国家满目疮痍。 腐朽、恐怖、阴暗，太阳底下没有新鲜事，过去的戏码再一遍一遍上演，每一次都变得更高级和更不可思议。 当初是冲着小狼去看的。第一二集小狼和男友分分合合，叛逆又深情认真的丹尼尔着实可爱。37岁，是剧中堪称完美的丹尼尔的年龄，也是我一直为之奋斗的重点。I will keep searching for that person. 救难民男友那一集是最让我揪心的，从毫不犹豫得飞去找男友，到被骗上当崩溃大哭，本来可以抛弃一切继续回到伦敦生活，但他却选择了爱情，沉溺于无情的大海和现实。原来丹尼尔从来都是一个专情的人，他只忠于爱情。 现实确实是会把人逼疯的，他们选择背水一战，选择冲破束缚他们的笼子，还好还好，他们成功了。而穆奶奶，这个让我又爱又恨的人物，小孙子丹尼尔溺亡，他选择接受丹尼尔的未婚夫；大孙子外遇，她选择将他扫地出门，并纳妻子为自己的家人；亚裔曾孙子有性别障碍，她鼓励她做自己夸她’you are beautiful.’；大孙女选择结束自己生命，穆奶奶仍能坐在沙发上向机器人说’good afternoon’… 我能感觉到岁月教会她坚忍，我不敢想象她经历过什么。 说实话，关于政治方面我知道的确实太少太少，这部剧因为有攻击领导人的嫌疑在中国被封，所以包括豆瓣和知乎上面都没有看到一丁点关于这部剧的讨论。 我在IMBD摘到了一个中国粉丝的review: China blocked the show after the second episode because it was suspected of attacking Chinese leaders. In fact, I don’t think he will really become a life leader. Because that is really against the education we receive. And historical trends. In 2022, we will see what happens. I hope that this world will develop in a good direction. I hope that the world will still be full of justice and fairness. I hope that the world will be a whole, not more and more fragmented. Recently, the US trade war behavior has made me very disappointed with the United States because they do not seem to want to promote free trade. In China, I feel more and more control, and the whole society is tightening. Because of the increasingly tense situation between China and the United States. In fact, the China-US conflict at the beginning of the film is very similar to reality. I can hardly distinguish between reality and illusion. This makes me very scared and deeply feels that politics is really about everyone’s life. The world seems to be moving in a bad direction. I hope that we can all be tolerant, have more understanding and reason, and not be incited and misled. I hope that all this will not happen as the drama. 正如他所说的，我也希望这个世界正常运转，不要把所有东西都托付于代码和计算机，希望这个国家能意识到我们是一个整体。 说实话，我没听明白大姐最后死前说的那些话，“I am LOVE.”也许过段时间我再拿出来看的时候会有新的感受。 最后一结尾的时候，看到一行话，in memory of Andrew Smith(1936-2018)，后来谷歌了这个人才知道他是编剧的男友，在去年去世。 完。","categories":[],"tags":[{"name":"观影日记","slug":"观影日记","permalink":"http://yoursite.com/tags/观影日记/"},{"name":"电视剧","slug":"电视剧","permalink":"http://yoursite.com/tags/电视剧/"}]},{"title":"word电子表格入门","slug":"电子表格入门","date":"2019-08-18T16:00:00.000Z","updated":"2019-08-21T10:04:29.106Z","comments":true,"path":"2019/08/19/电子表格入门/","link":"","permalink":"http://yoursite.com/2019/08/19/电子表格入门/","excerpt":"","text":"pt.1 准备 这篇文章将手把手带您使用word操作和绘制电子表格。在此之前，您需要确保您的计算机上装有WPS或文本工具软件。 检查是否安装过的方法很简单，您只需要在桌面空白处点击鼠标右键，并将鼠标移动到新建处，检查新出现的菜单中是否存在如下图所示的图标。您的计算机中至少需要存在其中一个。 pt.2 进入软件 点击其中一个图标，之后您会发现在桌面上出现了一个文件。这便是一个空白word文件。双击便可进入软件的操作界面。现在我们来看看这个软件中的布局。 最上面一栏为工具栏，包括了word中大部分精彩绝伦的功能；下面的空白处为编辑页面，也就是打印之后您可以实际看到的东西。 pt.3 创建表格 实际上，对于创建表格有其专门对应的电子表单软件，但是满足最简单基本的要求，word便足够了。 现在，我们开始创建一个表格。 在上方的工具栏处，您可以很轻松得找到插入按钮，点击之后会在其下方得工具栏中发现表格按钮，点击并滑动鼠标，您便可以轻松地选择您要创建几行几列的表格。之后点击鼠标右键，软件将会为您自动生成一个表格。当然往往这个表格并不尽人意，所以我们需要进行调整。 pt.4 编辑表格现在您可以把鼠标轻轻放在刚刚生成的表单上面，一起来看看我们可以在表单上做什么： 左上角的十字图标：点击这个图标之后，您可以随意拖动这个表格。 表格下方和右边都有加号，点击之后，您可以在相应的位置增加一列或者一行单元格。 拖动右下角的图标便可以轻松改变表格的长宽。 将鼠标放在表格的线上，然后进行拖拽，您便可以轻松地改变单元格的长度或者宽度。 pt.5 表格中的文字表格中的文字的格式就如同正常文本一样可以在开始工具栏中设置如字体大小、颜色等等。 文字居中功能似乎是表格中很常用的一个功能，您可以使用它将表头中的文字居中， pt.6 其他小技巧 合并单元格：拖拽选中您想要合并的单元格，点击鼠标右键，在出现的菜单中选择合并单元格即可。 pt.7 结束本文旨在于向初学者简单介绍word绘制电子表格，文中多有不足之处，欢迎批评指正，您可以发邮件给我：sx163yqq@163.com。 当然，您还可以点击这里去学习更多好玩的word技巧。","categories":[],"tags":[{"name":"自制教程","slug":"自制教程","permalink":"http://yoursite.com/tags/自制教程/"},{"name":"办公软件","slug":"办公软件","permalink":"http://yoursite.com/tags/办公软件/"}]},{"title":"很高兴见到你！","slug":"teat","date":"2019-08-12T14:41:52.388Z","updated":"2019-08-14T10:22:27.003Z","comments":true,"path":"2019/08/12/teat/","link":"","permalink":"http://yoursite.com/2019/08/12/teat/","excerpt":"","text":"Hello Darius!很高兴见到你，这是我的个人博客。你可以写邮件给我：sx163yqq@163.com","categories":[{"name":"Diary","slug":"Diary","permalink":"http://yoursite.com/categories/Diary/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"http://yoursite.com/tags/随笔/"},{"name":"你好","slug":"你好","permalink":"http://yoursite.com/tags/你好/"}]},{"title":"Hello World","slug":"hello-world","date":"2019-08-12T06:26:12.821Z","updated":"2019-08-13T13:01:18.968Z","comments":true,"path":"2019/08/12/hello-world/","link":"","permalink":"http://yoursite.com/2019/08/12/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}